<div class="container">
   <div class="hero-unit">
      <div class="row">
         <div class="col-md-6">
            <b><font size="6" face="american typewriter">Apache TinkerPop&trade;</font></b>
            <p><img src="images/tinkerpop-splash.png" width="420" class="img-responsive" style="padding:10px;"/></p>
            <p><font size="3">Apache TinkerPop&trade; is a graph computing framework for both graph databases (OLTP) and graph analytic systems (OLAP).</font></p>
         </div>
         <div class="col-md-6">
            <br/>
            <p>
               <b><font size="4">TinkerPop</font> <font size="4">3.2.2</font></b> (<font size="2">Released: 6-Sep-2016</font>)
            </p>
            <p><b>Downloads</b></p>
            <p>
               <a href="https://www.apache.org/dyn/closer.lua/tinkerpop/3.2.2/apache-tinkerpop-gremlin-console-3.2.2-bin.zip" class="btn btn-primary">Gremlin Console <span class="glyphicon glyphicon-download-alt"></span></a>
               <a href="https://www.apache.org/dyn/closer.lua/tinkerpop/3.2.2/apache-tinkerpop-gremlin-server-3.2.2-bin.zip" class="btn btn-primary">Gremlin Server <span class="glyphicon glyphicon-download-alt"></span></a>
               <a href="https://www.apache.org/dyn/closer.lua/tinkerpop/3.2.2/apache-tinkerpop-3.2.2-src.zip" class="btn btn-primary">Source <span class="glyphicon glyphicon-download-alt"></span></a>
            </p>
            <div class="row">
               <div class="col-md-6">
                  <p><b>Documentation</b></p>
                  <ul>
                     <li><a href="http://tinkerpop.apache.org/docs/current/reference/">TinkerPop3 Documentation</a></li>
                     <li><a href="http://tinkerpop.apache.org/docs/3.2.2/upgrade/#_tinkerpop_3_2_2">Upgrade Information</a></li>
                     <li>TinkerPop3 Javadoc</li>
                     <ul>
                        <li><a href="http://tinkerpop.apache.org/javadocs/current/core/">TinkerPop3 Core-Javadoc</a></li>
                        <li><a href="http://tinkerpop.apache.org/javadocs/current/full/">TinkerPop3 Full-Javadoc</a></li>
                     </ul>
                  </ul>
               </div>
               <div class="col-md-6">
                  <br/>
                  <a href="http://tinkerpop.apache.org/docs/current/tutorials/getting-started">
                     <img src="images/gremlin-gym-mini.png" width="150" class="img-responsive" align="left"/>
                  </a>
               </div>
            </div>
            <div class="row">
               <div class="col-md-5">
                  <div class="hovereffect">
                      <img src="images/cityscape-button.png" style="width:200px;" class="img-responsive" /></a>
                      <div class="overlay"><a class="info" href="gremlin.html">Understand Gremlin</a></div>
                  </div>
               </div>
               <div class="col-md-5">
                  <div class="hovereffect">
                      <img src="images/meeting-room-button.png" style="width:200px;" class="img-responsive" /></a>
                      <div class="overlay"><a class="info" href="providers.html">Become TinkerPop-Enabled</a></div>
                  </div>
               </div>
               <div class="col-md-2"></div>
            </div>
         </div>
      </div>
   </div>
   <div><br/></div>
   <div id="gremlinCarousel" class="carousel slide" data-ride="carousel" data-interval="30000" border="none">
      <!-- Indicators -->
      <ol class="carousel-indicators carousel-indicators-numbers">
         <li data-target="#gremlinCarousel" data-slide-to="0" class="active">1</li>
         <li data-target="#gremlinCarousel" data-slide-to="1">2</li>
         <li data-target="#gremlinCarousel" data-slide-to="2">3</li>
         <li data-target="#gremlinCarousel" data-slide-to="3">4</li>
         <li data-target="#gremlinCarousel" data-slide-to="4">5</li>
      </ol>
      <div class="carousel-inner" role="listbox">
         <div class="item active">
            <pre><code class="language-gremlin">


// What are the names of Gremlin's friends' friends?
g.V().has("name","gremlin").
  out("knows").out("knows").values("name")


    </code></pre>
         </div>
         <div class="item">
            <pre><code class="language-gremlin">
// What are the names of projects that were created by two friends?
g.V().match(
  as("a").out("knows").as("b"),
  as("a").out("created").as("c"),
  as("b").out("created").as("c"),
  as("c").in("created").count().is(2)).
    select("c").by("name")
    </code></pre>
         </div>
         <div class="item">
            <pre><code class="language-gremlin">

// What are the names of the managers in
//  the management chain going from Gremlin to the CEO?
g.V().has("name","gremlin").
  repeat(in("manages")).until(has("title","ceo")).
  path().by("name")

    </code></pre>
         </div>
         <div class="item">
            <pre><code class="language-gremlin">

// What is the distribution of job titles amongst Gremlin's collaborators?
g.V().has("name","gremlin").as("a").
  out("created").in("created").
    where(neq("a")).
  groupCount().by("title")

    </code></pre>
         </div>
         <div class="item">
            <pre><code class="language-gremlin">

// Get a ranking of the most relevant products for Gremlin given his purchase history.
g.V().has("name","gremlin").out("bought").aggregate("stash").
  in("bought").out("bought").
    where(not(within("stash"))).
  groupCount().
    order(local).by(values,decr)
    </code></pre>
         </div>
      </div>
   </div>
   <!-- /.carousel -->
   <div class="container">
      <h3>The Benefits of Graph Computing</h3>
      <p><img src="images/graph-globe.png" style="float:left;width:15%;padding:10px;"> A <strong>graph</strong> is a structure composed of <strong>vertices</strong> and <strong>edges</strong>.
         Both vertices and edges can have an arbitrary number of key/value-pairs called <strong>properties</strong>.
         Vertices denote discrete objects such as a person, a place, or an event. Edges denote relationships between vertices. For instance, a person may know
         another person, have been involved in an event, and/or was recently at a particular place. Properties express non-relational information about the
         vertices and edges. Example properties include a vertex having a name, an age and an edge having a timestamp and/or a weight. Together, the aforementioned
         graph is known as a <strong>property graph</strong> and it is the foundational data structure of Apache TinkerPop.
      </p>
      <br/>
      <p><img src="images/graph-vs-table.png" style="float:right;width:22%;padding:10px;">If a user's domain is composed of a heterogenous set of objects (vertices) that can be related to one another in a multitude of ways (edges),
         then a graph may be the right representation to use. In a graph, each vertex is seen as an atomic entity (not simply a "row in a table") that
         can be linked to any other vertex or have properties added or removed at will. This empowers the data modeler to think in terms of actors within
         a world of complex relations as opposed to, in relational databases, statically-typed tables joined in aggregate. Once a domain is modeled, that
         model must then be exploited in order to yield novel, differentiating information. Graph computing has a rich history that includes not only query
         languages devoid of table-join semantics, but also algorithms that support complex reasoning: path analysis, vertex clustering and ranking, subgraph
         identification, and more. The world of applied graph computing offers a flexible, intuitive data structure along with a host of algorithms able to
         effectively leverage that structure.
      </p>
      <br/>
      <p><a href="#"><img src="images/apache-tinkerpop-logo.png" style="float:left;width:22%;padding:10px;"/></a>Apache TinkerPop&trade; is an open source, vendor-agnostic, graph computing framework distributed under the commercial friendly <a href="http://www.apache.org/licenses/LICENSE-2.0">Apache2 license</a>.
         When a data system is <a href="providers.html">TinkerPop-enabled</a>, its users are able to model their domain as a graph and analyze that graph using the <a href="gremlin.html">Gremlin graph traversal language</a>.
         Furthermore, all TinkerPop-enabled systems integrate with one another allowing them to easily expand their offerings as well as allowing users to choose the appropriate graph
         technology for their application. Sometimes an application is best served by an in-memory, transactional graph database. Sometimes a multi-machine distributed graph database will do the job.
         Or perhaps the application requires both a distributed graph database for real-time queries and, in parallel, a Big(Graph)Data processor for batch analytics. Whatever the application's
         requirements, there exists a TinkerPop-enabled graph system out there to meet its needs.
      </p>
   </div>
   <h3>Contributing to Apache TinkerPop</h3>
   <div class="row">
      <div class="col-xs-12">
         <div class="row">
            <div class="col-xs-8">
               TinkerPop is an open source project that <a href="http://tinkerpop.apache.org/docs/current/dev/developer#_contributing">welcomes contributions</a>. There are many ways to get involved:
               <p/>
               <ol>
                  <li>
                     Join the <a href="http://groups.google.com/group/gremlin-users">Gremlin-Users</a> public mailing list.
                     <ul>
                        <li>Help users by answering questions and demonstrating your expertise in TinkerPop and graphs.</li>
                     </ul>
                  <li>
                     Join the <a href="https://lists.apache.org/list.html?dev@tinkerpop.apache.org">TinkerPop Developer</a> public mailing list.
                     <ul>
                        <li>Contribute ideas on how to make the TinkerPop code- and documentation-base better.</li>
                     </ul>
                  <li>Submit bug and feature issues to TinkerPop <a href="https://issues.apache.org/jira/browse/TINKERPOP/">JIRA</a>.</li>
                  <ul>
                     <li>Provide easily reproducible bug reports and well articulated feature requests.</li>
                  </ul>
                  <li>
                     Clone the TinkerPop <a href="https://github.com/apache/tinkerpop">Git repository</a> and provide a <a href="https://help.github.com/articles/using-pull-requests/">pull-request</a>.
                     <ul>
                        <li>Focus on a particular area of the codebase and take responsibility for your contribution.</li>
                     </ul>
                  <li>Make significant, long lasting contributions over time.</li>
                  <ul>
                     <li>Become a TinkerPop Committer and help determine the evolution of The TinkerPop.</li>
                  </ul>
               </ol>
               <p>To build TinkerPop from source, please review the <a href="http://tinkerpop.apache.org/docs/current/dev/developer/#building-testing">developer documentation</a>.
            </div>
            <div class="col-xs-4">
               <a href="http://tinkerpop.apache.org/docs/current/dev/developer/"><img src="images/gremlin-apache.png" width="250" class="img-responsive" /></a>
            </div>
         </div>
         <h3>Community Contributions</h3>
         TinkerPop is at the center of a larger development ecosystem that extends on its core interfaces, integration points, and ideas.  The graph systems and libraries below represent both
         TinkerPop-maintained reference implementations as well as third-party managed projects. The TinkerPop community is always interested in hearing about projects like these and aiding
         in their support. Please read our <a href="policy.html">provider listing policy</a> and feel free to promote such projects on the user and developer mailing lists. Information on
         how to build implementations of the various interfaces that TinkerPop exposes can be found in the <a href="http://tinkerpop.apache.org/docs/current/dev/provider/">Provider Documentation</a>.
         <p/>
            <a name="graph-systems"></a>
         <h4 id="graph-systems">Graph Systems</h4>
         <small>[<a href="providers.html#data-system-providers">learn more</a>]</small>
         <ul>
            <li><a href="https://github.com/blazegraph/tinkerpop3">Blazegraph</a> - RDF graph database with OLTP support.</li>
            <li><a href="http://www.datastax.com/products/datastax-enterprise-graph">DSEGraph</a> - DataStax graph database with OLTP and OLAP support.</li>
            <li><a href="http://tinkerpop.apache.org/docs/current/reference/#giraphgraphcomputer">Hadoop (Giraph)</a> - OLAP graph processor using Giraph.</li>
            <li><a href="http://tinkerpop.apache.org/docs/current/reference/#sparkgraphcomputer">Hadoop (Spark)</a> - OLAP graph processor using Spark.</li>
            <li><a href="https://console.ng.bluemix.net/catalog/services/ibm-graph/">IBM Graph</a> - OLTP graph database as a service.</li>
            <li><a href="http://tinkerpop.apache.org/docs/currentg/#neo4j-gremlin">Neo4j</a> - OLTP graph database.</li>
            <li><a href="https://github.com/pietermartin/sqlg">Sqlg</a> - RDBMS OLTP implementation with HSQLDB and Postresql support.</li>
            <li><a href="http://stardog.com/">Stardog</a> - RDF graph database with OLTP and OLAP support.</li>
            <li><a href="http://tinkerpop.apache.org/docs/current/reference/#tinkergraph-gremlin">TinkerGraph</a> - In-memory OLTP and OLAP reference implementation.</li>
            <li><a href="http://thinkaurelius.github.io/titan/">Titan</a> - Distributed OLTP and OLAP graph database with BerkeleyDB, Cassandra and HBase support.</li>
            <li><a href="https://github.com/awslabs/dynamodb-titan-storage-backend">Titan (Amazon)</a> - The Amazon DynamoDB storage backend for Titan.</li>
            <li><a href="https://github.com/classmethod/tupl-titan-storage-backend">Titan (Tupl)</a> - The Tupl storage backend for Titan.</li>
            <li><a href="https://github.com/rmagen/unipop">Unipop</a> - OLTP Elasticsearch and JDBC backed graph.</li>
         </ul>
         <a name="language-variants-compilers"></a>
         <h4 id="language-variants-compilers">Query Languages</h4>
         <small>[<a href="providers.html#query-language-providers">learn more</a>]</small>
         <ul>
            <li><a href="http://tinkerpop.apache.org/docs/current/reference/#gremlin-python">gremlin-python</a> (python/variant) - Gremlin hosted in Python for use with any Python-based VM.</li>
            <li><a href="https://github.com/emehrkay/gremlinpy">gremlin-py</a> (python/variant) - Write pure Python Gremlin that can be sent to Gremlin Server.</li>
            <li><a href="https://github.com/mpollmeier/gremlin-scala">gremlin-scala</a> (scala/variant) - A Scala-based Gremlin language variant for TinkerPop3.</li>
            <li><a href="https://github.com/jbmusso/gremlin-template-string">gremlin-template-string</a> (js/variant) - A Gremlin language builder.</li>
            <li><a href="https://github.com/davebshow/ipython-gremlin">ipython-gremlin</a> (python/variant) - Gremlin in IPython and Jupyter.</li>
            <li><a href="http://ogre.clojurewerkz.org/">ogre</a> (clojure/variant) - A Clojure language wrapper for TinkerPop3.</li>
            <li><a href="http://bayofmany.github.io/">Peapod</a> (java/dsl) - An object-graph-wrapper.</li>
            <li><a href="https://github.com/dkuppitz/sparql-gremlin">sparql-gremlin</a> (sparql/distinct) - A SPARQL to Gremlin traversal compiler.</li>
            <li><a href="https://github.com/twilmes/sql-gremlin">sql-gremlin</a> (sql/distinct) - An SQL to Gremlin traversal compiler.</li>
         </ul>
         <a name="language-drivers"></a>
         <h4 id="language-drivers">Language Drivers</h4>
         <ul>
            <li><a href="https://github.com/ZEROFAIL/goblin">Goblin</a> (python) - An asynchronous Python 3.5 toolkit for Gremlin Server.</li>
            <li><a href="https://github.com/davebshow/gremlinclient">gremlinclient</a> (python) - An asynchronous Python 2/3 client for Gremlin Server that allows for flexible coroutine syntax - Trollius, Tornado, Asyncio.</li>
            <li><a href="http://tinkerpop.apache.org/docs/current/reference/#connecting-via-java">gremlin-driver</a> (java) - A Gremlin Server driver for Java.</li>
            <li><a href="https://github.com/jbmusso/gremlin-javascript">gremlin-javascript</a> (js) - A Gremlin Server driver for JavaScript.</li>
            <li><a href="https://github.com/qasaur/gremgo">gremgo</a> (go) - A Gremlin Server driver for Go.</li>
            <li><a href="http://gremlinrestclient.readthedocs.org/en/latest/">gremlinrestclient</a> (python) - Python 2/3 library that uses HTTP to communicate with the Gremlin Server over REST.</li>
            <li><a href="https://github.com/PommeVerte/gremlin-php">gremlin-php</a> (php) - A Gremlin Server driver for PHP.</li>
            <li><a href="https://github.com/windj007/python-gremlin-rest">python-gremlin-rest</a> (python) - A REST-based client for Gremlin Server.</li>
            <li><a href="https://github.com/coreyauger/reactive-gremlin">reactive-gremlin</a> (scala) - An Akka HTTP Websocket Connector.</li>
            <li><a href="https://github.com/viagraphs/scalajs-gremlin-client">scalajs-gremlin-client</a> (scala) - A Gremlin-Server client with ad-hoc extensible, reactive, typeclass based API.</li>
            <li><a href="https://www.nuget.org/packages/Teva.Common.Data.Gremlin/">Teva Gremlin</a> (.NET - C#) - A Gremlin Server driver for .NET.</li>
            <li><a href="https://github.com/RedSeal-co/ts-tinkerpop">ts-tinkerpop</a> (typescript) - A helper library for Typescript applications via node-java.</li>
         </ul>
         <a name="tutorials"></a>
         <h4 id="tutorials">Tutorials</h4>
         <ul>
            <li><a href="http://tinkerpop.apache.org/docs/current/tutorials/getting-started/">Getting Started with TinkerPop</a> - Learn the basics of getting up and going with TinkerPop.</li>
            <li><a href="http://tinkerpop.apache.org/docs/current/tutorials/the-gremlin-console/">The Gremlin Console</a> - Discusses uses cases of the Gremlin Console and usage patterns.</li>
            <li><a href="http://tinkerpop.apache.org/docs/current/recipes/">Gremlin Recipes</a> - Reference for common traversal patterns and style.</li>
            <li><a href="http://tinkerpop.apache.org/docs/current/tutorials/gremlin-language-variants/">Gremlin Language Variants</a> - Learn how to embed Gremlin in a host programming language.</li>
            <li><a href="http://sql2gremlin.com/">SQL2Gremlin</a> - Learn Gremlin using typical patterns found when querying data with SQL.</li>
            <li><a href="https://academy.datastax.com/demos/getting-started-graph-databases">Getting Started with Graph Databases</a> - Compares relational databases to graph databases and SQL to Gremlin.</li>
         </ul>
         <a name="publications"></a>
         <h4 id="publications">Publications</h4>
         <ul>
            <li>Rodriguez, M.A., "<a href="http://www.datastax.com/dev/blog/gremlins-time-machine">Gremlin's Time Machine</a>," DataStax Engineering Blog, September 2016.</li>
            <li>Rodriguez, M.A., "<a href="http://www.slideshare.net/slidarko/gremlins-graph-traversal-machinery">Gremlin's Graph Traversal Machinery</a>," Cassandra Summit, September 2016.</li>
            <li>Rodriguez, M.A., "<a href="http://www.datastax.com/dev/blog/the-mechanics-of-gremlin-olap">The Mechanics of Gremlin OLAP</a>," DataStax Engineering Blog, April 2016.</li>
            <li>Rodriguez, M.A., "<a href="http://www.slideshare.net/slidarko/quantum-processes-in-graph-computing">Quantum Processes in Graph Computing</a>," GraphDay '16 Presentation, Austin Texas, January 2016. [<a href="https://www.youtube.com/watch?v=qRoAInXxgtc">video presentation</a>]</li>
            <li>Rodriguez, M.A., Watkins, J.H., "<a href="http://arxiv.org/abs/1511.06278">Quantum Walks with Gremlin</a>," GraphDay '16 Proceedings, Austin Texas, January 2016.</li>
            <li>Rodriguez, M.A., "(Keynote): <a href="http://www.slideshare.net/slidarko/acm-dbpl-keynote-the-graph-traversal-machine-and-language">The Gremlin Graph Traversal Machine and Language</a>," ACM Database Programming Language Conference Presentation, October 2015.</li>
            <li>Rodriguez, M.A., "<a href="http://arxiv.org/abs/1508.03843">The Gremlin Graph Traversal Machine and Language</a>," ACM Database Programming Languages Conference Proceedings, October 2015.</li>
            <li>Mallette, S.P., "<a href="http://www.slideshare.net/StephenMallette/tinkerpopfinal">What's New In Apache TinkerPop?</a>," Cassandra Summit, September 2015.</li>
            <li>Rodriguez, M.A., Kuppitz, D., "<a href="http://www.datastax.com/dev/blog/the-benefits-of-the-gremlin-graph-traversal-machine">The Benefits of the Gremlin Graph Traversal Machine</a>," DataStax Engineering Blog, September 2015.</li>
            <li>Rodriguez, M.A., Kuppitz, D., "<a href="http://www.slideshare.net/slidarko/the-gremlin-traversal-language">The Gremlin Graph Traversal Language</a>," 2015 NoSQLNow Conference, August 2015.</li>
            <li>Rodriguez, M.A., Kuppitz, D., Yim, K., "<a href="http://www.datastax.com/dev/blog/tales-from-the-tinkerpop">Tales from the TinkerPop</a>," DataStax Engineering Blog, July 2015.</li>
         </ul>
         <a name="committers"></a>
         <h3 id="committers">Apache TinkerPop Committers</h3>
         <img src="images/tinkerpop-logo-small.png" style="float:right" />TinkerPop seeks committers dedicated to the art of graph computing. TinkerPop committers bring solid theoretical,
         development, testing, documentation, etc. skills to the group. Committers contribute to TinkerPop beyond the everchanging requirements of their day-to-day jobs and maintain
         responsibility for their contributions through time.
         <p/>
         <ul>
            <li><a href="http://markorodriguez.com">Marko A. Rodriguez</a> (2009 - PMC): Gremlin language, Gremlin OLAP, documentation.</li>
            <li><a href="http://ketrinadrawsalot.tumblr.com">Ketrina Yim</a> (2009 - Committer): Illustrator, creator of Gremlin and his merry band of robots.</li>
            <li><a href="http://stephen.genoprime.com/">Stephen Mallette</a> (2011 - PMC Chair): Gremlin Console/Server/Driver, Graph I/O, testing, documentation, mailing list support.</li>
            <li><a href="http://jamesthornton.com/">James Thornton</a> (2013 - PMC): Promotions, evangelism.</li>
            <li><a href="http://gremlin.guru">Daniel Kuppitz</a> (2014 - PMC): Gremlin language design, benchmarking, testing, documentation, mailing list support.</li>
            <li><a href="https://www.linkedin.com/in/hzbarcea">Hadrian Zbarcea</a> (2015 - PMC): Project mentor, provider liason.</li>
            <li><a href="https://github.com/Humbedooh">Daniel Gruno</a> (2015 - PMC): Project mentor, infrastructure liason.</li>
            <li><a href="https://github.com/mhfrantz">Matt Frantz</a> (2015 - Committer): Gremlin language design, ts-tinkerpop.</li>
            <li><a href="https://github.com/pluradj">Jason Plurad</a> (2015 - PMC): Gremlin Console/Server, mailing list support.</li>
            <li><a href="https://www.linkedin.com/in/dylan-millikin-32567934">Dylan Millikin</a> (2015 - PMC): Gremlin Server/Driver, gremlin-php, GremlinBin, mailing list support.</li>
            <li><a href="https://github.com/twilmes">Ted Wilmes</a> (2015 - PMC): Promotions, mailing list support, benchmarking, sql-gremlin.</li>
            <li><a href="https://github.com/pietermartin">Pieter Martin</a> (2016 - Committer): Gremlin language, Sqlg.</li>
            <li><a href="https://github.com/jbmusso">Jean-Baptiste Musso</a> (2016 - Committer): Gremlin Server testing, Gremlin Driver (Node.js/JavaScript), mailing list support.</li>
            <li><a href="http://www.michaelpollmeier.com/">Michael Pollmeier</a> (2016 - Committer): Gremlin language, Gremlin-Scala.</li>
            <li><a href="https://github.com/davebshow">David Brown</a> (2016 - Committer): Python libraries, Gremlin Server testing.</li>
         </ul>
      </div>
   </div>
</div>
