image::tinkerpop3-logo.png[width=500]


:toc-position: left

// This directive does nothing.
// Seems the highlighter must be configured in the pom (?)
// :source-highlighter: coderay


The TinkerPop Story
===================

TinkerPop0
----------

The TinkerPop is the reality that begot Gremlin and all that Gremlin has ever known -- as well as that which is no knowledge. In *TinkerPop0*, Gremlin found himself alone in a world of reference as he moved about trying to understand why this structure existed and for what reason. Far is far and near is near for Gremlin. For The TinkerPop, this is true as well, but also west is right, down is forward, and Gremlin is The TinkerPop, as well as not. When will he realize this?

image::gremlin-logo.png[width=400]

TinkerPop1
----------

Confused by his wanders, for *TinkerPop1* Gremlin machined his friends Blueprints, Pipes, Frames, Furnace, and Rexster. However, The TinkerPop is elusive and difficult to realize through mechanical means. Gremlin thought that perhaps if the machines were more precise, they will allow him to more quickly, move through The TinkerPop and ultimately, understand it completely. With a little help from his friends, Gremlin traverses and traverses but when he is here, he is not there and thus, not fully with The TinkerPop which is everywhere.

image::gremlin-and-friends.png[width=600]

TinkerPop2
----------

Perhaps if he faster then he can be at all vertices at "once." In *TinkerPop2*, Gremlin created various optimizations to his machines. However, regardless of his haste, he is always stuck within his reference structure, patterned by his graph of associations that move him about --- ping, pong, ping, pong (a mere sliver of that which is The TinkerPop). Unsatisfied with his approach to The TinkerPop, he contemplated what TinkerPop3 would be. Gremlin reviewed the situation with his friends -- long discussions ensued.

image::tinkerpop-reading.png[width=500]

TinkerPop3
----------

His final push, his final emphatic expression of himself made him rethink his approach. For his third attempt he gathered his friends...

image::tinkerpop3-splash.png[width=500]

...and united them in such a way that their very nature became his. For *TinkerPop3* is the Gremlin and all the world will realize that it is all the world.

image::gremlintron.png[width=500]

Graph Computing
===============

A link:http://en.wikipedia.org/wiki/Graph_(data_structure)[graph] is a data structure composed of vertices (nodes, dots) and edges (arcs, lines). When modeling a graph in a computer and applying it to modern data sets and practices, the generic mathematically-oriented, binary graph is extended to support both labels and key/value properties. This structure is known as a property graph. More formally, it is a directed, binary, attributed multi-graph. An example property graph is diagrammed below. This graph example will be used extensively throughout the documentation and is called "TinkerPop Classic" as it is the original demo graph distributed with TinkerPop0 in 2009.

TIP: The TinkerPop classic graph is available with <<tinkergraph-reference-implementation,TinkerGraph>> via `TinkerFactory.createClassic()`. TinkerGraph is the reference implementation of TinkerPop3 and is used in all the examples in this documentation.

.TinkerPop Classic
image::tinkerpop-classic.png[width=500]

TinkerPop3 is the third incarnation of a graph computing framework. Similar to computing in general, graph computing makes a distinction between *structure* (graph) and *process* (traversal). The structure of the graph is the data model defined by a vertex/edge/property link:http://en.wikipedia.org/wiki/Network_topology[topology]. The process of the graph is the means by which the structure is analyzed. The typical form of graph processing is called a link:http://en.wikipedia.org/wiki/Graph_traversal[traversal].

.Primary components of the TinkerPop3 *structure* API 
 * `Graph`: maintains a set of vertices and edges, and access to database functions such as transactions.
 * `Element`: maintains a collection of properties and a string label denoting the element type.
  ** `Vertex`: extends Element and maintains a set of incoming and outgoing edges.
  ** `Edge`: extends Element and maintains an incoming and outgoing vertex.
 * `Property<V>`: a string key associated with a `V` value.

.Primary components of the TinkerPop3 *process* API
 * `Traversal<S,E>`: a functional data flow process transforming objects of type `S` to type `E`.
  ** `GraphTraversal`: a traversal that is oriented towards the semantics of the raw graph (i.e. vertices, edges, etc.).
 * `VertexProgram`: code executed at all vertices in a logically parallel fashion migrating the movement of messages. 

The purpose of this documentation is to describe the structure/process dichotomy at length and in doing so, explain how to leverage TinkerPop3 for the sole purpose of vendor-agnostic graph computing.

The Graph Structure
-------------------

image:gremlin-standing.png[width=125,float=left] A graph's structure is the topology formed by the explicit references between its vertices, edges, and properties. A vertex has incident edges. A vertex is adjacent to another vertex if they share an incident edge. A property is attached to an element and an element has a set of properties. A property is a key/value pair, where the key is always a character `String`. The graph structure API of TinkerPop3 provides the methods necessary to create such a structure. The classic TinkerPop graph previously diagrammed can be created with the following Java8 code. Note that this graph is available as a TinkerGraph using `TinkerFactory.createClassic()`.

[source,java]
Graph g = TinkerGraph.open();
Vertex marko = g.addVertex(Element.ID, 1, "name", "marko", "age", 29);
Vertex vadas = g.addVertex(Element.ID, 2, "name", "vadas", "age", 27);
Vertex lop = g.addVertex(Element.ID, 3, "name", "lop", "lang", "java");
Vertex josh = g.addVertex(Element.ID, 4, "name", "josh", "age", 32);
Vertex ripple = g.addVertex(Element.ID, 5, "name", "ripple", "lang", "java");
Vertex peter = g.addVertex(Element.ID, 6, "name", "peter", "age", 35);
marko.addEdge("knows", vadas, Element.ID, 7, "weight", 0.5f);
marko.addEdge("knows", josh, Element.ID, 8, "weight", 1.0f);
marko.addEdge("created", lop, Element.ID, 9, "weight", 0.4f);
josh.addEdge("created", ripple, Element.ID, 10, "weight", 1.0f);
josh.addEdge("created", lop, Element.ID, 11, "weight", 0.4f);
peter.addEdge("created", lop, Element.ID, 12, "weight", 0.2f);

In the above code all the vertices are created first and then their respective edges. There are two reserved keys: id (`Element.ID`) and label (`Element.LABEL`). When any of these, along with a set of other key value pairs is provided to `Graph.addVertex(Object...)` or `Vertex.addEdge(String,Vertex,Object...)`, the respective element is created along with the provided key/value pair properties appended to it. 

CAUTION: Many graph vendors do not allow the user to specify an element ID and in such cases, an `IllegalArgumentException` is thrown.

NOTE: In TinkerPop3, vertices are allowed a single immutable string label (similar to an edge label). This functionality did not exist in TinkerPop2.

Mutating the Graph
~~~~~~~~~~~~~~~~~~

Below is a sequence of basic graph mutation operations represented in Java8. One of the major differences between TinkerPop2 and TinkerPop3 is that in TinkerPop3, the Java convention of using setters and getters has been abandoned in favor of a syntax that is more aligned with the syntax of Gremlin-Groovy in TinkerPop2. Given that Gremlin-Java8 and Gremlin-Groovy are nearly identical due to the inclusion of Java8 lambdas, a big efforts was made to ensure that both languages are as similar as possible. 

TIP: image:groovy-logo.png[width=175,float=left] Gremlin-Groovy leverages the link:http://groovy.codehaus.org/[Groovy 2.x language] to express Gremlin traversals. One of the major benefits of Groovy is the inclusion of a runtime console that makes it easy for developers to practice with the Gremlin language and for production users to connect to their graph and execute traversals in an interactive manner. Moreover, Gremlin-Groovy provides various syntax simplifications.

CAUTION: In the code examples presented throughout this documentation, either Gremlin-Java8 or Gremlin-Groovy is used. Usually which derivative of Gremlin is being used is made explicit in the text, however, if not, a simple mouse over on the code block will state the language as either "JAVA" or "GROOVY."

[source,java]
// create a new graph
Graph g = TinkerGraph.open();
// add a software vertex with a name property
Vertex gremlin = g.addVertex(Element.LABEL, "software", "name", "gremlin");
// add a new property
gremlin.property("created",2009)
// add a new software vertex to the graph
Vertex blueprints = g.addVertex(Element.LABEL, "software", "name", "blueprints");
// connect gremlin to blueprints via a dependsOn-edge
Edge e = gremlin.addEdge("dependsOn",blueprints);
// add a property to the edge
e.property("since",2010)
// remove that property
e.property("since").remove()
// remove the entire edge
e.remove()
// connect gremlin to blueprints via encapsulates
gremlin.addEdge("encapsulates",blueprints)
// remove both blueprints and gremlin vertices
blueprints.remove()
gremlin.remove()
// the graph is empty
assert(g.V().count == 0)
assert(g.E().count == 0)

The Graph Process
-----------------

image:gremlin-running.png[width=125,float=left] The primary way in which graphs are processed are a graph traversal. A traversal is an algorithmic walk across the elements of a graph according to the referential structure explicit within the graph data structure. For example, starting at vertex 1, take all incident friendship-edges to adjacent friend vertices. Next, traverse from those friend-vertices to respective incident worksFor-edges to a collection of company-vertices. Finally, select the name-property value of company-vertices. Traversals in Gremlin are spawned from either a `Graph`, `Vertex`, or `Edge`. For example, Graph provides two traversal methods.

 . `Graph.V()`: generates a traversal starting at all vertices in the graph. 
 . `Graph.E()`: generates a traversal starting at all edges in the graph.

The return type of `V()` and `E()` is `GraphTraversal`. A GraphTraversal maintains numerous methods that return GraphTraversal. In this way, a GraphTraversal supports function composition and implements `Iterator` and `Iterable`. Each method of GraphTraversal is called a step and each step modulates the results of the previous step in one of three ways.

 . `map`: transform the incoming object to another object (S &rarr; E).
 . `flatMap`: transform the incoming object to an iterator of other objects (S &rarr; E^*^).
 . `filter`: allow or disallow the object from proceeding to the next step (S &rarr; S &cup; &empty;).

NOTE: Both map and filter can be represented as flatMap. Map can return an iterator with a single object in it. Filter can return an iterator with a single object in it or no object at all. Thus, flatMap is the most general construct -- "turn the incoming object into an iterator of objects."

Given the classic TinkerPop graph, the following query will return the names of all the people that Marko knows. The following query is demonstrated using Gremlin-Groovy.
[source,groovy]
gremlin> g.V().has('name','marko').out('knows').name
==>vadas
==>josh

Or, if the vertex marko is already realized with a direct reference pointer, then the traversal can be spawned off that vertex. This illustrates that vertex (as well as edge) also have `GraphTraversal`-return methods and an exploration of their respective JavaDocs will demonstrate what is available.

[source,groovy]
gremlin> marko = g.v(1)
==>v[1]
gremlin> marko.out('knows').name
==>vadas
==>josh

.The Name of The People That Marko Knows
image::tinkerpop-classic-ex1.png[width=500]

Again, all steps extend either map, flatMap, or filter. Thus, the traversal above can be written in its generic form below. Note the Gremlin-Groovy syntax convention of `v['name']`. This is Groovy syntactic sugar that resolved to `v.value('name')`. In the next section, the `it.get()` will be explained as this is an important feature of TinkerPop3 that is not available in previous version of TinkerPop. 

IMPORTANT: The steps map, flatMap, and filter take a link:http://en.wikipedia.org/wiki/Anonymous_function[lambda function] (i.e. an anonymous function or closure). For map, the function must return an object. For flatMap, the function must return an iterator of objects. For filter, the function is a predicate that returns either true or false. The lambdas introduced by Java8 are supported in TinkerPop3.

[source,groovy]
marko
  .filter{it.get()['name'] == 'marko'}
  .flatMap{it.get().out('knows')}
  .map{it.get()['name']}
==>vadas
==>josh

Finally, as a strictly academic exercise, the traversal can be written completely using flatMap.

[source,groovy]
marko
  .flatMap{it.get()['name'] == 'marko' ? [it.get()].iterator() : [].iterator()}
  .flatMap{it.get().out('knows')}
  .flatMap{[it.get()['name']].iterator()}
==>vadas
==>josh

NOTE: Gremlin-Java is much more aligned with Gremlin-Groovy in TinkerPop3 than it ever was before. In TinkerPop0 through TinkerPop2, Gremlin-Java was extremely verbose due to the simulation of lambdas via anonymous inner classes.  

The Traverser
~~~~~~~~~~~~~

When a traversal is executed, the source of the traversal is on the left of the expression (e.g. vertex 1), the steps are the middle of the traversal (e.g. `out("knows")` and `value("name")`), and the result is "traversal.next()'d" out of the right of the traversal (e.g. "vadas" and "josh").

image::traversal-mechanics.png[width=500]

In TinkerPop3, the objects propagating through the traversal are wrapped in a `Traverser<T>`. The traverser concept is new as of TinkerPop3 and provides the means by which steps remain stateless. A traverser maintains all the metadata about the traversal -- e.g., how many times the traverser has gone through a loop, the path history of the traverser, etc. This data can be accessed by a step:

[source,groovy]
marko.out('knows').name.path
==>[v[1], v[2], vadas]
==>[v[1], v[4], josh]

In the general form of the expression, the input to the functions map, flatMap, and filter are a `Traverser<T>`. Hence, the reason, the general form lambdas start with a `v.get()` (i.e. "get the raw object of the traverser containing a vertex"). The general form of path-step demonstrates how the metadata of the traverser is accessed without accessing the raw object. 

[source,groovy]
marko
  .filter{it.get()['name'] == 'marko'}
  .flatMap{it.get().out('knows')}
  .map{it.get()['name']}
  .map{it.getPath()}
==>[v[1], v[2], vadas]
==>[v[1], v[4], josh]

CAUTION: Path calculation is costly in terms of space as an array of previously seen objects is stored in each path of the respective traverser. Thus, traversal optimizers analyze the traversal to determine if path metadata is accessed. If not, then path calculations are turned off.

The Graph API
=============

Hidden Properties
~~~~~~~~~~~~~~~~~

A hidden property is a property that is hidden from the various property accessor methods. Hidden properties are typically used in situations where administrative data about an element must be stored that is not so much a description of the element itself. An itemization of use cases are presented below.

 * *Permissions*: What user or groups have read/write permission to this element?
 * *Time keeping*: When was this element created? When does this element expire?
 * *Presentation*: What color should this element be presented as?
 * *Provenance*: Which user created this element?
 * *Auditing*: Has this element been deleted from the system? Who deleted this element?

The hidden properties API is presented in the example below represented in the Gremlin-Groovy REPL. This REPL is accessible via `bin/gremlin.sh` (or `bin/gremlin.bat` for Windows users).


[source,groovy]
----
$ bin/gremlin.sh

         \,,,/
         (o o)
-----oOOo-(3)-oOOo-----
gremlin> g = TinkerGraph.open()
==>tinkergraph[vertices:0 edges:0]
gremlin> v = g.addVertex('name','pierre')
==>v[0]
gremlin> v.property('location','belgium')
==>p[location->belgium]
gremlin> v.property(Property.hidden('status'),'user')
==>p[status->user]
gremlin> v.keys()
==>name
==>location
gremlin> v.hiddenKeys()
==>status
gremlin> p = v.property(Property.hidden('status'))
==>p[status->user]
gremlin> p.isHidden()
==>true
gremlin> v.property('status')
==>p[empty]
----

Graph Variables
~~~~~~~~~~~~~~~

TinkerPop3 introduces the concept of `Graph.Variables`. Variables are key/value pairs associated with the graph itself. These variables are intended to store metadata about the graph. Examples include: schema information, global permissions data, etc.

Graph Transactions
~~~~~~~~~~~~~~~~~~

A link:http://en.wikipedia.org/wiki/Database_transaction[database transaction] is a unit of work.


The Traversal API
=================

Graph Traversal Steps
---------------------

The primary Traversal is `GraphTraversal`, and graph traversals can be spawned off of Graph, Vertex, and Edge. A list of all the steps are provided below along with a description. Note that a Traversal is defined as `Traversal<S,E>` where the `S` stands for start and the `E` stands for end. Likewise, each `Step<S,E>` maintains the same convention.

. Transform: S &rarr; E
 * `map(function)`: apply the provided function to S and emit the result as E.
 * `flatMap(function)`: apply the provided function to S and iterate the return iterator as a stream of E objects.
 * `identity`: emit S as E directly.
 * `out(string…)`: the S vertex is mapped to its string[]-adjacent E vertices.
 * ... 
. Filter: S &rarr; S &cup; &empty;
 * `filter(predicate)`: apply the predicate to S and if true, emit S else emit nothing.
 * `dedup`: if S has not been seen before emit it, else do not emit it.
 * ...
. SideEffect: S &rarr; S
 * `sideEffect(consumer)`: apply the consumer to S and then emit S.
 * …
. Branch: S &rarr; S
 * `jump(string)` : teleport S to the labeled string-labeled step in the traversal.
 * ...


Traversal Optimizers
--------------------

An `Optimizer` can analyze a `Traversal` and mutate the traversal as it deems fit. This is useful in two situations:

 * There is a more efficient way to express the traversal at the TinkerPop3 level.
 * There is a more efficient way to express the traversal at the graph vendor level.

An extremely simply Optimizer is the `IdentityOptimizer` and it is a type-1 optimizer defined as follows:

[source,java]
public class IdentityOptimizer implements Optimizer.FinalOptimizer {
    public void optimize(final Traversal traversal) {
        ((List<Step>) traversal.getSteps()).stream()
                .filter(step -> step instanceof IdentityStep
                    && !TraversalHelper.isLabeled(step))
                .collect(Collectors.<Step>toList())
                .forEach(step -> TraversalHelper.removeStep(step, traversal));
    }
}

This optimizer simply removes any unlabeled `IdentityStep` in the Traversal as `aStep().identity().identity().bStep()` is equivalent to `aStep().bStep()`. More common are type-2 optimizers which are defined by graph vendors who implement TinkerPop3.

[source,java]
g.V().has("name","marko")

The expression above can be executed in a `O(|V|)` or `O(log(|V|)` fashion in TinkerGraph depending on whether there is or is not an index defined for "name."

[source,java]
public class TinkerGraphStepOptimizer implements Optimizer.FinalOptimizer {
    public void optimize(final Traversal traversal) {
        if (traversal.getSteps().get(0) instanceof TinkerGraphStep) {
            final TinkerGraphStep tinkerGraphStep
                = (TinkerGraphStep) traversal.getSteps().get(0);
            Step currentStep = tinkerGraphStep.getNextStep();
            while (true) {
                if (currentStep == EmptyStep.instance()
                    || TraversalHelper.isLabeled(currentStep)) 
                    break;
                if (currentStep instanceof HasStep) {
                    tinkerGraphStep.hasContainers.add(
                        ((HasStep) currentStep).hasContainer);
                    TraversalHelper.removeStep(currentStep, traversal);
                } else if (currentStep instanceof IntervalStep) {
                    tinkerGraphStep.hasContainers.add(
                        ((IntervalStep) currentStep).startContainer);
                    tinkerGraphStep.hasContainers.add(
                        ((IntervalStep) currentStep).endContainer);
                    TraversalHelper.removeStep(currentStep, traversal);
                } else if (currentStep instanceof IdentityStep) {
                    // do nothing
                } else {
                    break;
                }
                currentStep = currentStep.getNextStep();
            }
            tinkerGraphStep.generateHolderIterator(false);
        }
    }
}

The traversal is redefined by simply taking an chain of `has()`-steps and `interval()`-steps after `g.V()` (`TinkerGraphStep`) and providing them to `TinkerGraphStep`. Then its up to TinkerGraphStep to determine if an appropriate index exists. In the code below, review `vertices()` and note how if an index exists, for a particular `HasContainer`, then that index is first queried before the remaining `HasContainer` filters are serially applied.

[source,java]
----
public class TinkerGraphStep<E extends Element> extends GraphStep<E> {

    private TinkerGraph graph;
    public List<HasContainer> hasContainers = new ArrayList<>();

    public TinkerGraphStep(Traversal traversal,
                           Class<E> returnClass,
                           TinkerGraph graph) {
        super(traversal, returnClass);
        this.graph = graph;
        this.generateHolderIterator(false);
    }

    public void generateHolderIterator(boolean trackPaths) {
        this.starts.clear();
        if (trackPaths)
          this.starts.add(new HolderIterator(this, this.vertices()));
        else
          this.starts.add(new HolderIterator(this.vertices()));
    }

    public void clear() {
        this.starts.clear();
    }

    private Iterator<Vertex> vertices() {
        HasContainer indexedContainer = getIndexKey(Vertex.class);
        return (Iterator) ((null == indexedContainer) ?
                TinkerHelper.getVertices(this.graph).parallelStream() :
                TinkerHelper.queryVertexIndex(this.graph, 
                    indexedContainer.key, 
                    indexedContainer.value).parallelStream())
                .filter(v -> HasContainer.testAll((Vertex) v, this.hasContainers))
                .collect(Collectors.toList()).iterator();
    }

    private HasContainer getIndexKey(Class<? extends Element> indexedClass) {
        Set<String> indexedKeys = this.graph.getIndexedKeys(indexedClass);
        return this.hasContainers.stream()
                .filter(c -> indexedKeys.contains(c.key)
                    && c.predicate.equals(Compare.EQUAL))
                .findFirst()
                .orElseGet(() -> null);
    }
}
----


Domain Specific Languages
-------------------------

The super interface of GraphTraversal is `Traversal`. It is possible for developers to create domain specific traversals by extending Traversal. For example, a `SocialTraversal` example is provided below.

[source,java]
----
public interface SocialTraversal<S, E> extends Traversal<S, E> {
   public default SocialTraversal<S, Vertex> people() {
     return (SocialTraversal) this.addStep(
       new StartStep<Vertex>(this, this.memory().<Graph>get("g").V().has("age")));
   }

   public default SocialTraversal<S, Vertex> people(String name) {
     return (SocialTraversal) this.addStep(
       new StartStep<Vertex>(this, this.memory().<Graph>get("g").V().has("name", name)));
   }

  public default SocialTraversal<S, Vertex> knows() {
    FlatMapStep<Vertex, Vertex> flatMapStep = new FlatMapStep<>(this);
    flatMapStep.setFunction(v -> v.get().out("knows"));
    return (SocialTraversal) this.addStep(flatMapStep);
  }

  public default SocialTraversal<S,String> name() {
    MapStep<Vertex,String> mapStep = new MapStep<>(this);
    mapStep.setFunction(v -> v.get().<String>getValue("name"));
    return (SocialTraversal) this.addStep(mapStep);
  }

  public static SocialTraversal of() {
    return new DefaultSocialTraversal();
  }

  public class DefaultSocialTraversal extends DefaultTraversal implements SocialTraversal {}
}
----

This traversal definition can now be used as follows.

[source,java]
g.traversal(SocialTraversal.class).people("marko").knows().name()

By extending Traversal, users can create a DSL that is respective of the semantics of their data. Instead of querying in terms of vertices/edges/properties, they can query in terms of, for example, people, their friends, and their names.

The GraphComputer API
=====================

TinkerPop3 provides two primary means of interacting with a graph: link:http://en.wikipedia.org/wiki/Online_transaction_processing[online transaction processing] (OLTP) and link:http://en.wikipedia.org/wiki/Online_analytical_processing[online analytical processing] (OLAP). OTLP-based graph systems allow the user to query the graph in real-time. However, typically, real-time performance is only possible when a local traversal is enacted. A local traversal is one that starts at a particular vertex (or small set of vertices) and only touches a small set of connected vertices (by any arbitrary path of arbitrary length). In short, OLTP queries touch a limited set of data and respond on the order of milliseconds or seconds. On the other hand, with OLAP graph processing, the entire graph is processed and thus, every vertex and edge is analyzed (some times more than once for iterative-based algorithms). Due to the amount of data being processed, the results are typically not returned in real-time and for massive graphs (i.e. graphs represented across a cluster of machines), results can take on the order of minutes or hours.

 * *OLTP*: real-time, limited data accessed, random data access, sequential processing, querying
 * *OLAP*: long running, entire data set accessed, sequential data access, parallel processing, batch processing

image::oltp-vs-olap.png[width=600]

The image above demonstrates the difference between Gremlin OLTP and Gremlin OLAP. With Gremlin OLTP, the graph is walked by moving from vertex-to-vertex via incident edges and in effect return various computations of that traversal. For example, the elements at the end of the path, the full path traversed, or some side-effect such as the count or various groupings of the objects seen during the traversal. Thus, each step (1,2,3), is a movement along this referential structure. With Gremlin OLAP, all vertices are provided a VertexProgram. That program runs in parallel to all other programs with the programs sending messages to one another according to the topological structure of the graph as a communication network (with random message passing possible). In many respects, the messages passed are like the OLTP traversers moving from vertex-to-vertex however, all messages are being working independent of one another, in parallel.

GraphComputer and VertexProgram
-------------------------------

In Gremlin, it is possible to express to have the same traversal executed either using the standard OTLP-engine or have it executed using the OLAP-engine. The difference being where the query is submitted.

[source,groovy]
g = TinkerFactory.createClassic()
==>tinkergraph[vertices:6 edges:6]
g.v(1).out('knows').name
==>vadas
==>josh
g.v(1).out('knows').name.submit(g.compute())
==>vadas
==>josh

The first traversal assumes the standard `Traversal` iterator should be `next'd()` for its results. The second traversal is submitted to `g.compute()` which is the `GraphComputer` associated with the graph `g`. GraphComputer forms the foundation of the OLAP model of TinkerPop3. GraphComputer takes a `VertexProgram`. A VertexProgram can be thought of as a piece of code that is executed at each vertex in logical parallel until some termination condition is met (e.g. a number of iterations have occurred, no more data is changing values, etc.). The GraphComputer is submitted a VertexProgram and that VertexProgram is copied to all the vertices in the graph. Then the GraphComputer orchestrates the execution of the `VertexProgram.execute()` method on all the vertices in an link:http://en.wikipedia.org/wiki/Bulk_synchronous_parallel[bulk synchronous parallel] (BSP) fashion. The vertices are then able to communicate with one another via messages. There are two types of messages in Gremlin OLAP: `LocalMessage` and `GlobalMessage`. A local message is a message to an incident edge or adjacent vertex. A global message is a message to any arbitrary element in the graph. 

image::graphcomputer.png[width=500]

NOTE: This model of graph computing was made popular by Google's link:http://googleresearch.blogspot.com/2009/06/large-scale-graph-computing-at-google.html[Pregel] graph system. In the open source world, this model is found in OLAP graph computing systems such as link:https://giraph.apache.org/[Giraph], link:https://hama.apache.org/[Hama], and link:http://faunus.thinkaurelius.com[Faunus].

[source,groovy]
g.v(1).out('knows').name.submit(g.compute())
==>vadas
==>josh

In the traversal above, the traversal is put into a newly constructed `TraversalVertexProgram` and that program is sent to each vertex in the graph. There are 3 BSP iterations and each iterations is interpreted as such:

 . If my vertex has the id 1, put a counter on my vertex.
 . For every counter at my vertex, send it to those vertices adjacent to me by a knows-edge.
 . For every counter at my vertex, send it to the name-property on my vertex.

When this returns, it returns an weighted iterator where those objects with counters are iterated and displayed for the number of counters on associated with that object.

NOTE: This model of path-based graph traversal in a BSP system was made popular by the link:http://faunus.thinkaurelius.com[Faunus] graph analytics system and originally described in link:http://markorodriguez.com/2011/04/19/local-and-distributed-traversal-engines/[Local and Distributed Traversal Engines]

A Collection of VertexPrograms
------------------------------

PageRankVertexProgram
~~~~~~~~~~~~~~~~~~~~~

Perhaps the most popular OLAP-oriented graph algorithm is link:http://en.wikipedia.org/wiki/PageRank[PageRank]. This eigenvector centrality variant was developed by Brin and Page of Google.

[source,java]
----
public class PageRankVertexProgram implements VertexProgram<Double> {

    private MessageType.Local messageType = MessageType.Local.of(new VertexQueryBuilder().direction(Direction.OUT));

    private double vertexCountAsDouble = 1;
    private double alpha = 0.85d;
    private int totalIterations = 30;

    public PageRankVertexProgram() {

    }

    public void initialize(final Configuration configuration) {
        this.vertexCountAsDouble = configuration.getDouble(VERTEX_COUNT, 1.0d);
        this.alpha = configuration.getDouble(ALPHA, 0.85d);
        this.totalIterations = configuration.getInt(TOTAL_ITERATIONS, 30);
    }

    public Map<String, KeyType> getComputeKeys() {
        return VertexProgram.ofComputeKeys(PAGE_RANK, KeyType.VARIABLE, EDGE_COUNT, KeyType.CONSTANT);
    }

    public Class<Double> getMessageClass() {
        return Double.class;
    }

    public void setup(final GraphComputer.SideEffects sideEffects) {

    }

    public void execute(final Vertex vertex, Messenger<Double> messenger, final GraphComputer.SideEffects sideEffects) {
        if (sideEffects.isInitialIteration()) {
            double initialPageRank = 1.0d / this.vertexCountAsDouble;
            double edgeCount = Long.valueOf(this.messageType.getQuery().build(vertex).count()).doubleValue();
            vertex.property(PAGE_RANK, initialPageRank);
            vertex.property(EDGE_COUNT, edgeCount);
            messenger.sendMessage(vertex, this.messageType, initialPageRank / edgeCount);
        } else {
            double newPageRank = StreamFactory.stream(messenger.receiveMessages(vertex, this.messageType)).reduce(0.0d, (a, b) -> a + b);
            newPageRank = (this.alpha * newPageRank) + ((1.0d - this.alpha) / this.vertexCountAsDouble);
            vertex.property(PAGE_RANK, newPageRank);
            messenger.sendMessage(vertex, this.messageType, newPageRank / vertex.<Double>property(EDGE_COUNT).orElse(0.0d));
        }
    }

    public boolean terminate(final GraphComputer.SideEffects sideEffects) {
        return sideEffects.getIteration() >= this.totalIterations;
    }
----


Gremlin Utilities
=================

Gremlin I/O
----------

The task of getting data in and out of `Graph` instances is the job of the Gremlin I/O packages.  Gremlin I/O provides two interfaces that for reading and writing `Graph` instances: `GraphReader` and `GraphWriter`.  These interfaces expose methods that support:

* Reading and writing an entire `Graph`
* Reading and writing a single `Vertex` (with and without associated `Edge` objects)
* Reading and writing a single `Edge`

In all cases, these methods operate in the currency of `InputStream` and `OutputStream` objects, allowing graphs and their related elements to be written to and read from files, byte arrays, etc.


GraphML Reader/Writer
~~~~~~~~~~~~~~~~~~~~~

The link:http://graphml.graphdrawing.org/[GraphML] file format is a common XML-based representation of a graph.  It is widely supported by graph-related tools and libraries making it a solid interchange format for TinkerPop.  In other words, if the intent is to work with graph data in conjunction with applications outside of TinkerPop, GraphML maybe be the best choice to do that.  Common use cases might be:

* Generate a graph link:https://networkx.github.io/[NetworkX], export it with GraphML and import it to TinkerPop.
* Produce a subgraph and export it to GraphML to be consumed by and visualized in link:https://gephi.org/[Gephi].
* Migrate the data of an entire graph to a different graph database no supported by TinkerPop.

As GraphML is a specification for the serialization of an entire graph and not the individual elements of a graph, methods that support input and output of single vertices and edges are not supported.

CAUTION: GraphML is a "lossy" format in that it only supports primitive values for properties and does not have support for `Graph` variables.  It will use `toString` to serialize property values outside of those primitives.

The following code shows how to write a `Graph` instance to file called `tinkerpop-classic.xml` and then how to read that file back into a different instance:

[source,java]
----
final Graph g = TinkerFactory.createClassic();
try (final OutputStream os = new FileOutputStream("tinkerpop-classic.xml")) {
    GraphMLWriter.create().build().writeGraph(os, g);
}

final GraphReader reader = GraphMLReader.create().build();
try (final InputStream stream = new FileInputStream("tinkerpop-classic.xml")) {
    reader.readGraph(stream, g);
}
----

GraphSON Reader/Writer
~~~~~~~~~~~~~~~~~~

GraphSON is a JSON-based format that developed from earlier versions of TinkerPop.  It is not backward compatible to prior versions.  GraphSON has some support from graph-related application outside of TinkerPop, but it is generally best used in two cases:

* A text format of the graph or its elements is desired (e.g. debugging, usage in source control, etc.)
* The graph or its elements need to be consumed by code that is not JVM-based (e.g. Python, .NET, etc.)

GraphSON supports all of the `GraphReader` and `GraphWriter` interface methods and can therefore read or write an entire `Graph`, a single `Vertex` or a single `Edge`.  The following code shows how to write a `Graph` instance to file called `tinkerpop-classic.json` and then how to read that file back into a different instance:

[source,java]
----
final Graph g = TinkerFactory.createClassic();
try (final OutputStream os = new FileOutputStream("tinkerpop-classic.json")) {
    GraphSONWriter.create().build().writeGraph(os, g);
}

final GraphReader reader = GraphSONReader.create().build();
try (final InputStream stream = new FileInputStream("tinkerpop-classic.json")) {
    reader.readGraph(stream, g);
}
----

The `GraphSONReader` and `GraphSONWriter` have a number of options that they can be configured with.  One of the important options is the ability to embed type information into the output.  By embedding the types, it becomes possible to serialize a graph without losing type information that might be important when being consumed by another source.  The importance of this concept is demonstrated in the following example where a single `Vertex` is written to GraphSON using the Gremlin Console:

[source,groovy]
----
gremlin> g = TinkerFactory.createClassic()
==>tinkergraph[vertices:6 edges:6]
gremlin> w = GraphSONWriter.create().build()
==>com.tinkerpop.gremlin.structure.io.graphson.GraphSONWriter@1af146
gremlin> f = new FileOutputStream('test.txt')
==>java.io.FileOutputStream@5c8eee0f
gremlin> w.writeVertex(f, g.v(1), Direction.BOTH)
==>null
gremlin> f.close()
----

The following GraphSON example shows the output of `GraphSonWriter.writeVertex()` with associated edges:

[source,js]
----
{
    "inV": [],
    "id": 1,
    "label": "default",
    "type": "vertex",
    "outV": [
        {
            "inV": 3,
            "inVLabel": "default",
            "outVLabel": "default",
            "id": 9,
            "label": "created",
            "type": "edge",
            "outV": 1,
            "properties": {
                "weight": 0.4
            }
        },
        {
            "inV": 2,
            "inVLabel": "default",
            "outVLabel": "default",
            "id": 7,
            "label": "knows",
            "type": "edge",
            "outV": 1,
            "properties": {
                "weight": 0.5
            }
        },
        {
            "inV": 4,
            "inVLabel": "default",
            "outVLabel": "default",
            "id": 8,
            "label": "knows",
            "type": "edge",
            "outV": 1,
            "properties": {
                "weight": 1
            }
        }
    ],
    "properties": {
        "name": "marko",
        "age": 29
    }
}
----

The vertex properly serializes to valid JSON but note that a consuming application will not automatically know how to interpret the numeric values.  In coercing those Java values to JSON, such information is lost.  For example, it is no longer clear if the `weight` value on the edges should be read as a `Double` or an `Float`.

With a minor change to the construction of the `GraphSONWriter` the lossy nature of GraphSON can be avoided:

[source,groovy]
----
gremlin> w = GraphSONWriter.create().embedTypes(true).build()
==>com.tinkerpop.gremlin.structure.io.graphson.GraphSONWriter@350ec41e
----

In the above code, the `embedTypes` option is set to `true` and the output below shows the difference in the output:

[source,js]
----
{
    "@class": "java.util.HashMap",
    "inV": [
        "java.util.ArrayList",
        []
    ],
    "id": 1,
    "label": "default",
    "type": "vertex",
    "outV": [
        "java.util.ArrayList",
        [
            {
                "@class": "java.util.HashMap",
                "inV": 3,
                "inVLabel": "default",
                "outVLabel": "default",
                "id": 9,
                "label": "created",
                "type": "edge",
                "outV": 1,
                "properties": {
                    "@class": "java.util.HashMap",
                    "weight": [
                        "java.lang.Float",
                        0.4
                    ]
                }
            },
            {
                "@class": "java.util.HashMap",
                "inV": 2,
                "inVLabel": "default",
                "outVLabel": "default",
                "id": 7,
                "label": "knows",
                "type": "edge",
                "outV": 1,
                "properties": {
                    "@class": "java.util.HashMap",
                    "weight": [
                        "java.lang.Float",
                        0.5
                    ]
                }
            },
            {
                "@class": "java.util.HashMap",
                "inV": 4,
                "inVLabel": "default",
                "outVLabel": "default",
                "id": 8,
                "label": "knows",
                "type": "edge",
                "outV": 1,
                "properties": {
                    "@class": "java.util.HashMap",
                    "weight": [
                        "java.lang.Float",
                        1
                    ]
                }
            }
        ]
    ],
    "properties": {
        "@class": "java.util.HashMap",
        "name": "marko",
        "age": 29
    }
}
----

The ambiguity of components of the GraphSON is now removed by the `@class` property, which contains Java class information for the data it is associated with.  While the output is more verbose, it comes with the security of not losing type information.  While non-JVM languages won't be able to consume this information automatically, at least there is a hint as to how the values should be coerced back into the correct types in the target language.

Kryo Reader/Writer
~~~~~~~~~~~~~~~~~~

The link:https://github.com/EsotericSoftware/kryo[Kryo] format is a binary format Graph serialization format designed for usage by JVM languages.  It is designed to be an efficient, non-lossy and represents the standard format to use when working with data inside of the TinkerPop stack.  Common use cases include:

* Migration from one Gremlin Structure implementation to another (e.g. `TinkerGraph` to `Neo4jGraph`)
* Serialization of individual graph elements to be sent over the network to another JVM.
* Backups of in-memory graphs or subgraphs.

CAUTION: When migrating between Gremlin Structure implementations, Kryo may not lose data, but it is important to consider the features of each `Graph` and whether or not the data types supported in one will be supported in the other.  Failure to do so, may result in errors.

Kryo supports all of the `GraphReader` and `GraphWriter` interface methods and can therefore read or write an entire `Graph`, a single `Vertex` or a single `Edge`.  The following code shows how to write a `Graph` instance to file called `tinkerpop-classic.gio` and then how to read that file back into a different instance:

[source,java]
----
final Graph g = TinkerFactory.createClassic();
try (final OutputStream os = new FileOutputStream("tinkerpop-classic.gio")) {
    KryoWriter.create().build().writeGraph(os, g);
}

final GraphReader reader = KryoReader.create().build();
try (final InputStream stream = new FileInputStream("tinkerpop-classic.gio")) {
    reader.readGraph(stream, g);
}
----

NOTE: The preferred extension for files names produced by Kryo `.gio`.

Graph Strategy
--------------

A Graph Strategy provides a way to expand, inspect or otherwise alter the behavior of a `Graph` implementation.  A Graph Strategy injects arbitrary functions into the `Graph` API, so that when a method call is made, the strategy functions can manipulate the default behavior of the underlying `Graph`.  TinkerPop3 is packaged with the following strategies:

* `IdGraphStrategy` - enables support for custom element identifiers for those graphs which don't otherwise support them
* `PartitionGraphStrategy` - enables support for logical graph partitioning where the `Graph` can be blinded to different parts of the total graph
* `ReadOnlyGraphStrategy` - prevents writing to the `Graph`
* `SequenceGraphStrategy` - apply multiple `GraphStrategy` implementations in sequenced ordered to a single `Graph` instance

NOTE: TinkerPop2 had the notion of "Graph Wrappers" which decorated standard `Graph` implementations with additional features.  A Graph strategy is generally analogous to that capability.

To use a `GraphStrategy` instance, use the `GraphFactory` to instantiate the `Graph` as follows:

[source,groovy]
----
gremlin> conf = new BaseConfiguration()
==>org.apache.commons.configuration.BaseConfiguration@5b40ceb
gremlin> conf.setProperty("gremlin.graph","com.tinkerpop.gremlin.tinkergraph.structure.TinkerGraph")
==>null
gremlin> g = GraphFactory.open(conf, Optional.of(new ReadOnlyGraphStrategy()))
==>[readonlygraphstrategy[tinkergraph[vertices:0 edges:0]]]
----

The above code specifies the creation of a `TinkerGraph` with the use of `ReadOnlyGraphStrategy`.  Note that the `GraphFactory` does not return a `TinkerGraph` instance.  It returns a `StrategyWrappedGraph` which is a holder for the underlying `TinkerGraph` and the `ReadOnlyGraphStrategy`.  Since `StrategyWrappedGraph` implements the `Graph` interface, it can be used in the same manner as `TinkerGraph` or any other implementation.

[source,groovy]
----
gremlin> g.addVertex('name','stephen')
Graph uses class com.tinkerpop.gremlin.structure.strategy.ReadOnlyGraphStrategy and is therefore unmodifiable
----

The above code tries to mutate the underlying `TinkerGraph`.  Note that `ReadOnlyGraphStrategy` prevents that and throws an exception.  At any point, the `GraphStrategy` can be bypassed by getting the underlying `TinkerGraph`.

[source,groovy]
----
gremlin> bg = g.getBaseGraph()
==>tinkergraph[vertices:0 edges:0]
gremlin> bg.addVertex('name','stephen')
==>v[0]
gremlin> g.v(0l).value('name')
==>stephen
----

By getting the "base graph" (i.e. the underlying `TinkerGraph`) it is possible to mutate the graph.  The above code demonstrates that and also shows that it then possible to read back that added vertex.

Gremlin Server
--------------

Gremlin Server provides a way to remotely execute Gremlin scripts against one or more `Graph` instances hosted within it.  The benefits of using Gremlin Server include:

* Allows any Gremlin Structure-enabled graph to exist as a standalone server, which in turn enables the ability for multiple clients to communicate with the same graph database.
* Enables execution of ad-hoc queries through remotely submitted Gremlin scripts.
* Allows for the hosting of Gremlin-based DSLs (Domain Specific Language) that expand the Gremlin language to match the language of the application domain, which will help support common graph use cases such as searching, ranking, and recommendation.
* Provides a method for Non-JVM languages (e.g. Python, .NET, etc.) to communicate with the TinkerPop stack.
* Exposes numerous methods for extension and customization to include serialization options, remote commands, etc.

NOTE: Gremlin Server is essentially the replacement for link:http://rexster.tinkerpop.com[Rexster].

Communication with Gremlin Server occurs over link:http://en.wikipedia.org/wiki/WebSocket[WebSockets] and exposes a custom subprotocol for interacting with the server.  The most direct way to get started with Gremlin Server is to issue it some remote Gremlin scripts from the Gremlin Console.  To do that, first start Gremlin Server:

[source,text]
----
$bin/gremlin-server.sh config/gremlin-server-min.yaml
[INFO] GremlinServer -
         \,,,/
         (o o)
-----oOOo-(_)-oOOo-----

[INFO] GremlinServer - Configuring Gremlin Server from config/gremlin-server-min.yaml
[INFO] MetricManager - Configured Metrics Slf4jReporter configured with interval=180000ms and loggerName=com.tinkerpop.gremlin.server.Settings$Slf4jReporterMetrics
[INFO] GremlinServer$WebSocketServerInitializer - Configured application/vnd.gremlin-v1.0+kryo with com.tinkerpop.gremlin.driver.ser.KryoMessageSerializerV1d0
[INFO] GremlinServer$WebSocketServerInitializer - Configured application/vnd.gremlin-v1.0+kryo-stringd with com.tinkerpop.gremlin.driver.ser.KryoMessageSerializerV1d0
[INFO] Graphs - Graph [g] was successfully configured via [config/tinkergraph-empty.properties].
[INFO] GremlinExecutor - Getting dependencies for [[org.apache.commons, commons-math3, 3.2]]
[INFO] GremlinExecutor - Initialized gremlin-groovy ScriptEngine with scripts/generate-modern.groovy
[INFO] GremlinServer$WebSocketServerInitializer - Initialized GremlinExecutor and configured ScriptEngines.
[INFO] GremlinServer$WebSocketServerInitializer - Initialized Gremlin thread pool.  Threads in pool named with pattern gremlin-*
[INFO] GremlinServer - Gremlin Server configured with worker thread pool of 1 and boss thread pool of 1
[INFO] GremlinServer - Websocket channel started at port 8182.
----

Gremlin Server is configured by the provided link:http://www.yaml.org/[YAML] file `config/gremlin-server-min.yaml`.  That file tells Gremlin Server many things such as:

* The host and port to serve on
* Thread pool sizes
* Where to report metrics gathered by the server
* The serializers to make available
* The Gremlin `ScriptEngine` instances to expose and external dependencies to inject into them
* `Graph` instances to expose

The log messages that printed above show a number of things, but most importantly, there is a `Graph` instance named `g` that is exposed in Gremlin Server.  This graph is an in-memory TinkerGraph and was empty at the start of the server.  An initialization script at `scripts/generate-sample.groovy` was executed during startup.  It's contents are as follows:

[source,groovy]
----
include::../gremlin-server/scripts/generate-modern.groovy[]
----

This script loads the "modern" graph into the empty TinkerGraph instance, preparing it for use.  With Gremlin Server running it is now possible to issue some scripts to it for processing.  Start Gremlin Console as follows:

[source,text]
----
$ bin/gremlin.sh

         \,,,/
         (o o)
-----oOOo-(3)-oOOo-----
gremlin>
----

When the console starts, it is preconfigured to connect to a remote Gremlin Server listening on `localhost` at port `8182`:

[source,groovy]
----
gremlin> :remote
==>remote - results as text [localhost/127.0.0.1:8182]
----

The `:remote` command shown above displays the current status of the remote connection.  This command can also be used to configure a new connection and change other related settings.  To actually send a script to the server a different command is required:

[source,groovy]
----
gremlin> :> g.V.name
==>Item{resultItem=marko class=java.lang.String}
==>Item{resultItem=stephen class=java.lang.String}
==>Item{resultItem=matthias class=java.lang.String}
==>Item{resultItem=daniel class=java.lang.String}
==>Item{resultItem=gremlin class=java.lang.String}
==>Item{resultItem=blueprints class=java.lang.String}
gremlin> :> g.V.has('name','gremlin').in('uses').name
==>Item{resultItem=marko class=java.lang.String}
==>Item{resultItem=daniel class=java.lang.String}
gremlin> :> g.E.label.groupCount()
==>Item{resultItem={dependsOn=1, created=5, uses=2} class=java.lang.String}
----

The `:>` command, which is a shorthand for `:submit`, sends the script to the server to execute there.  Results are wrapped in an `Item` object which is a just a holder for each individual result.  The `class` shows the data type for the containing value.  Note that the last script sent was supposed to return a `Map`, but its `class` is `java.lang.String`.  By default, the connection is configured to only return text results.  In other words, Gremlin Server is using `toString` to serialize all results back to the console.  This enables virtually any object on the server to be returned to the console, but it doesn't allow the opportunity to work with this data in any way in the console itself.  As was stated earlier, the `:remote` command can be used to configure the connection to Gremlin Server.  One of the options available is to have results returned as `objects` instead of `text`:

[source,groovy]
----
gremlin> :remote as objects <1>
==>results as objects
gremlin> :> g.E.label.groupCount() <2>
==>Item{resultItem={dependsOn=1, created=5, uses=2} class=java.util.HashMap}
gremlin> m = _l[0].get(Map.class) <3>
==>dependsOn=1
==>created=5
==>uses=2
gremlin> m.sort{-it.value}
==>created=5
==>uses=2
==>dependsOn=1
----

<1> Tells Gremlin Server to serialize the results in a way that they can be deserialized back into an `Object` in the Console with the caveat being that the server and console both know how to serialize and deserialize the result to be returned.
<2> When the script is executed again, the `class` is no longer shown to be a `java.lang.String`.  It is instead a `java.util.HashMap`.
<3> The last result of a remote script is always stored in the reserved variable `_l`, which allows access to the `Item` and by virtue of that, the `Map` itself.

Implementations
===============

[[tinkergraph-reference-implementation]]
TinkerGraph
-----------

image:tinkerpop-character.png[width=100,float=left] TinkerGraph is a single machine, in-memory, non-transactional graph engine that provides both OLTP and OLAP functionality. It is deployed with TinkerPop3 and serves as the reference implementation for other vendors to study in order to understand the semantics of the various methods of the TinkerPop3 API. Constructing a simple graph in Java8 is presented below.

[source,java]
Graph g = TinkerGraph.open();
Vertex marko = g.addVertex("name","marko","age",29);
Vertex lop = g.addVertex("name","lop","lang","java");
marko.addEdge("created",lop,"weight",0.6d);

The above graph creates two vertices named "marko" and "lop" and connects them via a created-edge with a weight=0.6 property. Next, the graph can be queried as such.

[source,java]
g.V().has("name","marko").out("created").value("name")

The `g.V().has("name","marko")` part of the query can be executed in two ways.

 * A linear scan of all vertices filtering out those vertices that don't have the name "marko"
 * A `O(log(|V|))` index lookup for all vertices with the name "marko"

Given the initial graph construction in the first code block, no index was defined and thus, a linear scan is executed. However, if the graph was constructed as such, then an index lookup would be used.

[source,java]
Graph g = TinkerGraph.open();
g.createIndex("name",Vertex.class)

Each graph vendor will have different mechanism by which indices and schemas are defined. TinkerPop3 does not require any conformance in this area. In TinkerGraph, the only definitions are around indices. With other vendors, property value types, indices, edge labels, etc. may be required to be defined _a priori_ to adding data to the graph.

Neo4j-Gremlin
-------------

Giraph-Gremlin
--------------
